DescriptorFile.xml

<?xml version="1.0" encoding="utf-8" ?>

<synapse-unit-test>

    <artifact-file>/Users/sajithaliyanage/Documents/Projects/synapse-unit-testing-framework/seq.xml</artifact-file>

    <test-cases>
        <test-case>
            <assert-input-payload>
                <![CDATA[
                        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
                           <soapenv:Header />
                           <soapenv:Body>
                              <ser:getQuote>
                                 <!--Optional:-->
                                 <ser:request>
                                    <!--Optional:-->
                                    <xsd:symbol>WSO2</xsd:symbol>
                                 </ser:request>
                              </ser:getQuote>
                           </soapenv:Body>
                        </soapenv:Envelope>
                ]]>
            </assert-input-payload>

            <assert-expected-properties>
                {
                    "WHERE":"before doing stuff",
                    "SAJITHA":"yes did it"
                }
            </assert-expected-properties>

            <assert-expected-payload>
                <![CDATA[
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://services.samples/xsd" xmlns:ser="http://services.samples">
                       <soapenv:Header/>
                       <soapenv:Body>
                          <ser:getQuote  >
                             <!--Optional:-->
                             <ser:request>
                                <!--Optional:-->
                                <xsd:symbol>WSO2</xsd:symbol>
                                <xsd:symbol>SUN</xsd:symbol>
                             </ser:request>
                          </ser:getQuote  >
                       </soapenv:Body>
                    </soapenv:Envelope>
                ]]>
            </assert-expected-payload>
        </test-case>
    </test-cases>

</synapse-unit-test>
